backend/docs/api.tex
% Created 2013-08-30 Fri 12:35
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage[normalem]{ulem}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{amstext}
\usepackage{hyperref}
\tolerance=1000
\date{\today}
\title{api}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={<a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.2.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)}}
\begin{document}

\maketitle
\tableofcontents


\section{Overview}
\label{sec-1}
The Materials Commons Web Services (mcapi) allows users to interact with the
Materials Commons service without using the \href{http://materialscommons.org}{Materials Commons Website}. The
website is composed using these services. This means that you can script
all the functionality you see in the website.

The mcapi is accessed using RESTful urls. Many of the calls are privileged
and require an apikey. You can specify an apikey even on services that don't
require one.

Getting an apikey is simple. If you have an account at the website then you
automatically have one. You can see your apikey by logging into the website
and clicking on your account. Alternatively you can use mcapi itself to
retrieve your key. This call is the only call you specify your username and
password with.

The base URL for the mcapi services is \url{https://api.materialscommons.org}. All
urls start with \texttt{/<version>} where version is currently \texttt{v1.0}.
For example to get a list of all public data files you could use curl like this:
\begin{verbatim}
curl -XGET https://api.materialscommons.org/v1.0/datafiles
\end{verbatim}

The apikey is specified as an argument. For example, if your \emph{username} is \texttt{i@donotexist.com}
and your apikey is \texttt{abc123}, to look at your list of data files loaded onto
Materials Commons you would use:
\begin{verbatim}
curl -XGET https://api.materialscommons.org/v1.0/user/i@b.com/data?apikey=abc123
\end{verbatim}

It might seem strange to have to specify your username when you are also using your
apikey. However, your apikey is used to check your permissions. If another user has
given you access to look at their private data files then you could put their username
in place of your own.

\subsection{API Calls}
\label{sec-1-1}
The api calls are broken into a number of different sections. Some calls relate
to users, some to public data such as tags or publicly released data files, some
are administrative in nature, such as changing your password. The set of services
is constantly being updated so check back here often.

A url such as /usergroup/<usergroup>/data means that you specify the name of the
usergroup in the <usergroup> parameter. For example:

\begin{verbatim}
curl -XGET https://api.materialscommons.org/v1.0/usergroup/mygroup/datafiles
\end{verbatim}

The HTTP verbs are used in the following ways:

\begin{center}
\begin{tabular}{ll}
Verb & Meaning\\
\hline
GET(G) & Retrieve value\\
JSONP(J) & Retrieve value wrap in javascript call\\
PUT(P) & Update existing\\
POST(S) & Create new\\
DELETE(D) & Delete existing\\
\end{tabular}
\end{center}

In the tables below items between angled brackets, e.g. <u>, are parameters.
If a call requires an APIKEY that means it is an authenticated call.

The calls below are subject to change. In particular calls may be changed to
require an APIKEY, have their URL changed to better follow our naming
convention, or changed to a different verb above to better reflect their.
functionality.

\textbf{This is a living document as we continue to expand our set of web services.}
The column specifies whether a user needs to specify an APIKEY for
authorization/authentication purposes.

The current set of API calls and the verbs they support are listed below:

\subsubsection{Tag Services}
\label{sec-1-1-1}

\begin{center}
\begin{tabular}{llll}
URL & VERBS & a? & Notes\\
\hline
/tag & S &  & \\
/tag/<tag> & D & x & \\
/tags & GJ &  & \\
/tags/count & GJ &  & \\
\end{tabular}
\end{center}
\subsubsection{Misc calls}
\label{sec-1-1-2}
\begin{center}
\begin{tabular}{llll}
URL & VERBS & a? & Notes\\
\hline
/datafiles & GJ &  & Get public data files\\
/datadirs & GJ &  & Get public data dirs\\
/usergroups & GJ &  & Get public user groups\\
/usergroups/new & S &  & Create new public user group\\
/news & GJ &  & Get site news items\\
/news/new & S &  & Create new news item\\
/news/id & D &  & Delete news item\\
/users & GJ &  & Get list of users of site\\
/newuser & S &  & Create new user\\
\end{tabular}
\end{center}
\subsubsection{Usergroups}
\label{sec-1-1-3}

NOTE: These calls are likely to change.

All URLs start with \textbf{/usergroup/<ug>}

\begin{center}
\begin{tabular}{llll}
URL & VERBS & a? & Notes\\
\hline
/datafiles & GJ &  & Get public dfiles for usergroup\\
/users & GJ &  & Get users in usergroup\\
/username/<u> & P &  & Add user to usergroup\\
/username/<u>/remove & P &  & Remove user from usergroup\\
\end{tabular}
\end{center}

\subsubsection{User Account Services}
\label{sec-1-1-4}

All URLs start with \textbf{/user/<u>}

\begin{center}
\begin{tabular}{llll}
URL & VERBS & a? & Notes\\
\hline
/user/<u> & GJ & x & Retrieve user info\\
/<pw>/apikey & GJ &  & Retrieves the APIKEY\\
/password/<newpw> & P & x & Change password\\
/apikey/reset & P &  & Reset the API key\\
/usergroups & GJ & x & Get users usergroups\\
/all$_{\text{usergroups}}$ & GJ & x & Retrieve all usergroups\\
\end{tabular}
\end{center}

\subsubsection{User Datadir services}
\label{sec-1-1-5}

These calls do not download actual files or directories . They retrieve
the data structures describing them.

All URLs start with \textbf{/user/<u>}

\begin{center}
\begin{tabular}{llll}
URL & VERBS & a? & Notes\\
\hline
/datadir/<ddid> & GJ & x & Get  Datadir\\
/datadirs & GJ & x & Get all datadirs\\
/datadirs/datafiles & GJ & x & Get dirs and files\\
/datadirs/tree/groups & GJ & x & Get tree of groups datadirs\\
/datadirs/tree & GJ & x & Get tree of user's datadirs\\
 &  &  & \\
\end{tabular}
\end{center}
\subsubsection{User Datafile services}
\label{sec-1-1-6}

These calls do not download actual files or directories . They retrieve
the data structures describing them.

All URLs start with \textbf{/user/<u>}

\begin{center}
\begin{tabular}{llll}
URL & GET & a? & Notes\\
\hline
/datafiles & GJ & x & Retrieves user's datafiles\\
/datafiles/tag/<tag> & GJ & x & Tags used on all users datafiles\\
/datafiles/update/<dfid> & P & x & Update data on datafile\\
/tags/count & GJ & x & Get tags/counts for datafiles\\
/datafile/<dfid> & GJ & x & Get datafile if user has access\\
\end{tabular}
\end{center}

\subsubsection{User Review Services}
\label{sec-1-1-7}

All URLs start with \textbf{/user/<u>}

\begin{center}
\begin{tabular}{llll}
URL & VERBS & a? & Notes\\
\hline
/reviews & GJ & x & Reviews for user\\
/reviews/requested & GJ & x & Reviews requested by user\\
/review/<id> & D & x & Delete review\\
/review & S & x & Create a review\\
/datafile/reviews/<dfid> & GJ & x & Reviews for datafile\\
/review/<id>/mark/<as> & P &  & Mark review as done/not done\\
\end{tabular}
\end{center}
\subsubsection{User Upload/Download Services}
\label{sec-1-1-8}

All URLs start with \textbf{/user/<u>}

\begin{center}
\begin{tabular}{llll}
URL & VERBS & a? & Notes\\
\hline
/udqueue & GJ & x & List user's upload/download queue\\
/upload/<ddid> & S & x & Upload a file to datadir\\
/download/file/<dfid> & G & x & Download a user's file\\
\end{tabular}
\end{center}
% <a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.2.1 (<a href="http://orgmode.org">Org</a> mode 8.0.6)
\end{document}
